app/controllers/order_data_controller.rb

INSERT INTO "orders" ("c_first_name", "c_last_name", "c_address", "c_city", "c_zip", "c_state", "c_telephone", "c_email", "r_first_name", "r_last_name", "r_address", "r_city", "r_state", "r_zip", "r_telephone", "r_email", "r_date", "r_time", "r_special_instructions", "r_guests", "package", "t1_size", "t1_flavor", "t1_filling", "t2_size", "t2_flavor", "t2_filling", "t3_size", "t3_flavor", "t3_filling", "t4_size", "t4_flavor", "t4_filling", "t5_size", "t5_flavor", "t5_filling", "base_price", "flower_price", "rolled_chocolate_price", "tiering_price", "delivery_price", "balance", "deposit", "consultant", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
        order.vendor_balance = params["vendor_balance"].downcase
        order.consultant = params["consultant"].downcase

        confirmation = order.save

SELECT "orders".* FROM "orders" WHERE (c_first_name = 'nicholas')
---
    def search
        query = {}
        params.each_pair { |key, value|
            if(value != "")
                query[key] = value
            end
        }
        query.delete "controller"
        query.delete "action"
        query.delete "authenticity_token"

        @order = Order.where(query)